Documents/ЗаявлениеНаПредоставлениеВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаПредоставлениеВычетовИПН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрименениеВычетовИПН</xr:Item>
				<xr:Item>InformationRegister.ВычетыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ЛьготыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ПрочиеВычетыФизическихЛицИПН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьСтандартныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлятьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПодтверждающийПравоНаЛьготу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПрочиеВычеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЗаявления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПодтверждающийПравоНаВычет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вычеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидВычетаИПН</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредоставлятьВычет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрименениеВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрименениеВычетовИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявлениеНаПредоставлениеВычетовИПН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Сотрудник)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("Сотрудник", "");
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
			Месяц = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ,"Месяц");
			Если Месяц < '20180101' Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаДокументаДо2018";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Печать заявления.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ЗаявлениеНаПредоставлениеВычетовИПН";
	КомандаПечати.Идентификатор = "ЗаявлениеНаПредоставлениеВычета";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на предоставление вычетов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Печать заявления утв. форма 
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ЗаявлениеНаПредоставлениеВычетовИПН";
	КомандаПечати.Идентификатор = "ЗаявлениеНаПредоставлениеВычета2025";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на предоставление вычетов ИПН (Приказ МФ РК от 1.02.2018 года № 102)'");
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаПредоставлениеВычета") Тогда
		ТабличныйДокумент = ТабличныйДокументЗаявлениеЗаявлениеНаПредоставлениеВычета(МассивОбъектов, ОбъектыПечати);
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	
				"ЗаявлениеНаПредоставлениеВычета", 
				НСтр("ru = 'Заявление на предоставление вычетов'"), 
				ТабличныйДокумент,
				,
				"Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПФ_MXL_ЗаявлениеНаПредоставлениеВычетовИПН");
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаПредоставлениеВычета2025") Тогда
		ТабличныйДокумент = ТабличныйДокументЗаявлениеЗаявлениеНаПредоставлениеВычета2025(МассивОбъектов, ОбъектыПечати);
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	
				"ЗаявлениеНаПредоставлениеВычета2025", 
				НСтр("ru = 'Заявление на предоставление вычетов ИПН (Приказ МФ РК от 1.02.2018 года № 102) (не исп.)'"), 
				ТабличныйДокумент,
				,
				"Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПФ_MXL_ЗаявлениеНаПредоставлениеВычетовИПН2025");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТабличныйДокументЗаявлениеЗаявлениеНаПредоставлениеВычета(МассивОбъектов, ОбъектыПечати)
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаПредоставлениеЛьготИВычетовИПН";
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПФ_MXL_ЗаявлениеНаПредоставлениеВычетовИПН");
	
	//Области до 2018
	ОбластьШапкаВычетДо2018					= Макет.ПолучитьОбласть("ШапкаВычетДо2018");
	ОбластьШапкаЛьготаДо2018				= Макет.ПолучитьОбласть("ШапкаЛьготаДо2018");
	
	ОбластьЛьготаДо2018						= Макет.ПолучитьОбласть("ЛьготаДо2018");
	ОбластьТекстЛьготаДо2018				= Макет.ПолучитьОбласть("ТекстЛьготаДо2018");
	ОбластьТекстСтандартныйВычетДо2018		= Макет.ПолучитьОбласть("ТекстСтандартныйВычетДо2018");
	ОбластьСтандартныйПрочийВычетДо2018		= Макет.ПолучитьОбласть("СтандартныйПрочийВычетДо2018");
	ОбластьТекстПрочийВычетДо2018			= Макет.ПолучитьОбласть("ТекстПрочийВычетДо2018");
	ОбластьПрочийВычетДо2018				= Макет.ПолучитьОбласть("ПрочийВычетДо2018");
	
	ОбластьПодвалДо2018						= Макет.ПолучитьОбласть("ПодвалДо2018");
	
	//Области после 2018
	ОбластьШапка							= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаВычеты						= Макет.ПолучитьОбласть("СтрокаВычеты");
	ОбластьОснованиеШапка					= Макет.ПолучитьОбласть("ОснованиеШапка");
	ОбластьОснованиеСтрока					= Макет.ПолучитьОбласть("ОснованиеСтрока");
	ОбластьОснованиеПодвал					= Макет.ПолучитьОбласть("ОснованиеПодвал");
	ОбластьПодвал							= Макет.ПолучитьОбласть("Подвал");
	
	
	ДанныеДляПечати = ДанныеДляПечатиЗаявленияНаПредоставлениеВычетов(МассивОбъектов);
	
	ВыборкаПоДокументамДо2018	= ДанныеДляПечати.РезультатПоШапкеДо2018.Выбрать();
	ВыборкаПоСтрокамДо2018		= ДанныеДляПечати.РезультатПоТабличнойЧастиДо2018.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаПоДокументам			= ДанныеДляПечати.РезультатДокументы.Выбрать();
	
	// Вывод до 2018
	ФИОСотрудникаРодительный  = "";
	ФИОДиректораОрганизацииДательный = "";
	ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	
	Пока ВыборкаПоДокументамДо2018.Следующий() Цикл
		
		//Стандартные вычеты
		Если ВыборкаПоДокументамДо2018.ИзменитьСтандартныйВычет 
				И ВыборкаПоДокументамДо2018.ПредоставлятьСтандартныйВычет Тогда
				
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
			ДанныеСотрудника = КадровыйУчет.КадровыеДанныеФизическихЛиц(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.Сотрудник), 
			"ФИОПолные, ИОФамилия, Пол", ВыборкаПоДокументамДо2018.Дата);
			
			ДанныеРуководителя = КадровыйУчет.КадровыеДанныеФизическихЛиц(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации), 
			"Пол", ВыборкаПоДокументамДо2018.Дата);
			
			Если ДанныеСотрудника.Количество() > 0 Тогда
				
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеСотрудника[0].ФИОПолные),
				2, ФИОСотрудникаРодительный, ДанныеСотрудника[0].Пол);
				
				ОбластьШапкаВычетДо2018.Параметры.ФИОСотрудникаРодительный = ФИОСотрудникаРодительный;
				ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ДанныеСотрудника[0].ИОФамилия;
			КонецЕсли;
			
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации),
			3, ФИОДиректораОрганизацииДательный, ?(ДанныеРуководителя.Количество()= 0, Неопределено, ДанныеРуководителя[0].Пол));
			
			ОбластьШапкаВычетДо2018.Параметры.ФИОДиректораОрганизации	= ФИОДиректораОрганизацииДательный;
			ОбластьШапкаВычетДо2018.Параметры.НазваниеОрганизации 		= ВыборкаПоДокументамДо2018.НазваниеОрганизации;
			ОбластьШапкаВычетДо2018.Параметры.ИИНСотрудника 			= ВыборкаПоДокументамДо2018.ИИНСотрудника;
			
			ТабДокумент.Вывести(ОбластьШапкаВычетДо2018);
			ТабДокумент.Вывести(ОбластьТекстСтандартныйВычетДо2018);
			ТабДокумент.Вывести(ОбластьСтандартныйПрочийВычетДо2018);
			
			ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ВыборкаПоДокументамДо2018.Сотрудник;
			ОбластьПодвалДо2018.Параметры.Дата = ПерсонифицированныйУчет.ДатаВОтчет(ВыборкаПоДокументамДо2018.Дата);
			
			ТабДокумент.Вывести(ОбластьПодвалДо2018);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументамДо2018.Ссылка);
			
			
		КонецЕсли;
		
		//Льгота
		Если ВыборкаПоДокументамДо2018.ИзменитьЛьготу 
			И ВыборкаПоДокументамДо2018.ПредоставлятьЛьготу Тогда
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			ДанныеСотрудника = КадровыйУчет.КадровыеДанныеФизическихЛиц(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.Сотрудник), 
			"ФИОПолные, ИОФамилия, Пол", ВыборкаПоДокументамДо2018.Дата);
			
			ДанныеРуководителя = КадровыйУчет.КадровыеДанныеФизическихЛиц(
			Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации), 
			"Пол", ВыборкаПоДокументамДо2018.Дата);
			
			Если ДанныеСотрудника.Количество() > 0 Тогда
				
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеСотрудника[0].ФИОПолные),
				2, ФИОСотрудникаРодительный, ДанныеСотрудника[0].Пол);
				
				ОбластьШапкаЛьготаДо2018.Параметры.ФИОСотрудникаРодительный = ФИОСотрудникаРодительный;
				ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ДанныеСотрудника[0].ИОФамилия;
			КонецЕсли;
			
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации),
			3, ФИОДиректораОрганизацииДательный, ?(ДанныеРуководителя.Количество()= 0, Неопределено,ДанныеРуководителя[0].Пол));
			
			ОбластьШапкаЛьготаДо2018.Параметры.ФИОДиректораОрганизации	= ФИОДиректораОрганизацииДательный;
			ОбластьШапкаЛьготаДо2018.Параметры.НазваниеОрганизации 		= ВыборкаПоДокументамДо2018.НазваниеОрганизации;
			ОбластьШапкаЛьготаДо2018.Параметры.ИИНСотрудника 			= ВыборкаПоДокументамДо2018.ИИНСотрудника;
			
			ТабДокумент.Вывести(ОбластьШапкаЛьготаДо2018);
			ТабДокумент.Вывести(ОбластьТекстЛьготаДо2018);
			
			ОбластьЛьготаДо2018.Параметры.КатегорияЛицаПолучателяЛьготы = ВыборкаПоДокументамДо2018.КатегорияЛицаПолучателяЛьготы;
			ОбластьЛьготаДо2018.Параметры.Основание = ВыборкаПоДокументамДо2018.ДокументПодтверждающийПравоНаЛьготу;
			
			ТабДокумент.Вывести(ОбластьЛьготаДо2018);
			
			ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ВыборкаПоДокументамДо2018.Сотрудник;
			ОбластьПодвалДо2018.Параметры.Дата = ПерсонифицированныйУчет.ДатаВОтчет(ВыборкаПоДокументамДо2018.Дата);
			
			ТабДокумент.Вывести(ОбластьПодвалДо2018);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументамДо2018.Ссылка);
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка",ВыборкаПоДокументамДо2018.Ссылка);
		
		//Прочие вычеты
		Пока ВыборкаПоСтрокамДо2018.НайтиСледующий(СтруктураПоиска) Цикл
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
			ДанныеСотрудника = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.Сотрудник), 
				"ФИОПолные, ИОФамилия, Пол", ВыборкаПоДокументамДо2018.Дата);
			
			ДанныеРуководителя = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации), 
				"Пол", ВыборкаПоДокументамДо2018.Дата);
			
			Если ДанныеСотрудника.Количество() > 0 Тогда
				
				ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеСотрудника[0].ФИОПолные),
					2, ФИОСотрудникаРодительный, ДанныеСотрудника[0].Пол);
				
				ОбластьШапкаВычетДо2018.Параметры.ФИОСотрудникаРодительный = ФИОСотрудникаРодительный;
				ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ДанныеСотрудника[0].ИОФамилия;
			КонецЕсли;
			
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ВыборкаПоДокументамДо2018.ФИОДиректораОрганизации),
				3, ФИОДиректораОрганизацииДательный, ?(ДанныеРуководителя.Количество()= 0, Неопределено,ДанныеРуководителя[0].Пол));
			
			ОбластьШапкаВычетДо2018.Параметры.ФИОДиректораОрганизации	= ФИОДиректораОрганизацииДательный;
			ОбластьШапкаВычетДо2018.Параметры.НазваниеОрганизации 		= ВыборкаПоДокументамДо2018.НазваниеОрганизации;
			ОбластьШапкаВычетДо2018.Параметры.ИИНСотрудника 			= ВыборкаПоДокументамДо2018.ИИНСотрудника;
			
			ТабДокумент.Вывести(ОбластьШапкаВычетДо2018);
			ТабДокумент.Вывести(ОбластьТекстПрочийВычетДо2018);
			
			ОбластьПрочийВычетДо2018.Параметры.ВидВычета 	   = ВыборкаПоСтрокамДо2018.ВидВычетаИПН;
			ОбластьПрочийВычетДо2018.Параметры.Сумма		   = ВыборкаПоСтрокамДо2018.Размер;
			ОбластьПрочийВычетДо2018.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ВыборкаПоСтрокамДо2018.Размер, ВалютаУчета);
			ОбластьПрочийВычетДо2018.Параметры.Основание 	   = ВыборкаПоСтрокамДо2018.ДокументПодтверждающийПравоНаВычет;
			
			ТабДокумент.Вывести(ОбластьПрочийВычетДо2018);
			ТабДокумент.Вывести(ОбластьСтандартныйПрочийВычетДо2018);
			
			ОбластьПодвалДо2018.Параметры.СотрудникРасшифровкаПодписи = ВыборкаПоДокументамДо2018.Сотрудник;
			ОбластьПодвалДо2018.Параметры.Дата = ПерсонифицированныйУчет.ДатаВОтчет(ВыборкаПоДокументамДо2018.Дата);
			
			ТабДокумент.Вывести(ОбластьПодвалДо2018);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументамДо2018.Ссылка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Вывод после 2018
	
	Пока ВыборкаПоДокументам.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ФИОСотрудникаРодительный  = "";
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ВыборкаПоДокументам.ФИОПолные),
		2, ФИОСотрудникаРодительный, ВыборкаПоДокументам.Пол);
		
		ОбластьШапка.Параметры.ФИОСотрудника = ФИОСотрудникаРодительный;
		ОбластьШапка.Параметры.ИИНСотрудника = ВыборкаПоДокументам.ИНН;
		ОбластьПодвал.Параметры.СотрудникРасшифровкаПодписи = ВыборкаПоДокументам.ИОФамилия;
		
		ОбластьШапка.Параметры.НаименованиеОрганизации	= ВыборкаПоДокументам.НаименованиеОрганизации;
		ОбластьШапка.Параметры.ИИНБИНОрганизации		= ВыборкаПоДокументам.ИИНБИНОрганизации;
		
		ТабДокумент.Вывести(ОбластьШапка);
		
		НомерСтроки = 1;
		МассивОснований = Новый Массив;
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			ОбластьСтрокаВычеты.Параметры.НомерСтроки = НомерСтроки;
			ОбластьСтрокаВычеты.Параметры.ВидВычета   = ВыборкаПоДокументам.ВидВычета;
			Если ВыборкаПоДокументам.СуммаВычета > 0 Тогда
				ТекстСуммыВычета = НСтр("ru = '- %1 тенге'");
				ТекстСуммыВычета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСуммыВычета, ВыборкаПоДокументам.СуммаВычета);
				ОбластьСтрокаВычеты.Параметры.СуммаВычета = ТекстСуммыВычета;
			Иначе	
				ОбластьСтрокаВычеты.Параметры.СуммаВычета = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаПоДокументам.Основание) Тогда
				МассивОснований.Добавить(ВыборкаПоДокументам.Основание);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрокаВычеты);
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		Если МассивОснований.Количество()> 0 Тогда
			
			ТабДокумент.Вывести(ОбластьОснованиеШапка);
			
			Для каждого Элемент Из МассивОснований Цикл
				
				ОбластьОснованиеСтрока.Параметры.Основание = Элемент;
				ТабДокумент.Вывести(ОбластьОснованиеСтрока);
				
			КонецЦикла;
			
			ОбластьОснованиеПодвал.Параметры.ОснованиеКоличество = Формат(МассивОснований.Количество(),"ЧН=");
			ТабДокумент.Вывести(ОбластьОснованиеПодвал);
			
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Дата = Формат(ВыборкаПоДокументам.Дата,"ДЛФ=DD");
		ТабДокумент.Вывести(ОбластьПодвал);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ТабличныйДокументЗаявлениеЗаявлениеНаПредоставлениеВычета2025(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаПредоставлениеЛьготИВычетовИПН2025";
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПФ_MXL_ЗаявлениеНаПредоставлениеВычетовИПН2025");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ЗаявлениеВычетовИПН2020");
	
	ДанныеДляПечати = ДанныеДляПечатиЗаявленияНаПредоставлениеВычетов(МассивОбъектов);
	
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатДокументы.Выбрать();
	
	СоответствиеВычетов = Новый Соответствие;
	СоответствиеВычетов.Вставить("ВычетОПВ", "ВычетОПВ");
	СоответствиеВычетов.Вставить("ВычетВОСМС", "ВычетВОСМС");
	СоответствиеВычетов.Вставить("ВычетСтандартный", "ВычетСтандартный");
	СоответствиеВычетов.Вставить("ВычетМногоденые", "ВычетМногоденые");
	СоответствиеВычетов.Вставить("ВычетДПВ", "ВычетДПВ");
	СоответствиеВычетов.Вставить("ВычетОбучение", "ВычетОбучение");
	СоответствиеВычетов.Вставить("ВычетМедицина", "ВычетМедицина");
	СоответствиеВычетов.Вставить("ВычетВознаграждения", "ВычетВознаграждения");
	СоответствиеВычетов.Вставить("ВычетПредварительный", "ВычетПредварительный");
	
	Пока ВыборкаПоДокументам.СледующийПоЗначениюПоля("Ссылка") Цикл

		Если ВыборкаПоДокументам.Месяц < Дата('20250101') Тогда
			Продолжить;	
		КонецЕсли;
		
		ФИОСотрудникаИменительный = Строка(ВыборкаПоДокументам.ФИОПолные);
		ФИОСотрудникаРодительный  = "";
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ВыборкаПоДокументам.ФИОПолные), 2, ФИОСотрудникаРодительный, ВыборкаПоДокументам.Пол);
		
		ОбластьШапка.Параметры.ФИОСотрудникаРП = ФИОСотрудникаРодительный;
		ОбластьШапка.Параметры.ФИОСотрудникаИП = ФИОСотрудникаИменительный;
		ОбластьШапка.Параметры.ИИНСотрудника = ВыборкаПоДокументам.ИНН;
		
		ОбластьШапка.Параметры.НаименованиеОрганизации	= ВыборкаПоДокументам.НаименованиеОрганизации;
		ОбластьШапка.Параметры.ИИНБИНОрганизации		= ВыборкаПоДокументам.ИИНБИНОрганизации;
		
		ДеньПодписи  = Формат(ВыборкаПоДокументам.Дата,"ДФ=dd");
		МесяцПодписи = НРег(Формат(ВыборкаПоДокументам.Дата,"ДФ=MMMM"));
		ГодПодписи   = Формат(ВыборкаПоДокументам.Дата,"ДФ=yyyy");
		
		ФизическиеЛицаЗарплатаКадры.Просклонять(МесяцПодписи, 2, МесяцПодписи, Перечисления.ПолФизическогоЛица.Мужской);

		ОбластьШапка.Параметры.Дата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '""%1"" %2 %3 %4'"), ДеньПодписи, МесяцПодписи, ГодПодписи, НСтр("ru = 'года'"));
		
		Для Каждого СтрокаСоответствиеВычетов Из СоответствиеВычетов Цикл
			
			ОбластьШапка.Параметры[СтрокаСоответствиеВычетов.Значение] = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '□ %1'"), НСтр("ru = ' да'")); 
			
		КонецЦикла;
		
		ПризнакСогласия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '■ %1'"), НСтр("ru = ' да'"));
		
		Пока ВыборкаПоДокументам.Следующий() Цикл
			
			Если ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный1МЗП
				ИЛИ ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды
				ИЛИ ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители Тогда
				
				ОбластьШапка.Параметры["ВычетСтандартный"] = ПризнакСогласия; 
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ВычетОПВ Тогда
				
				ОбластьШапка.Параметры["ВычетОПВ"] = ПризнакСогласия;
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ВычетВОСМС Тогда
				
				ОбластьШапка.Параметры["ВычетВОСМС"] = ПризнакСогласия;
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы Тогда
				
				ОбластьШапка.Параметры["ВычетДПВ"] = ПризнакСогласия; 
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.НаОплатуМедицинскихУслуг Тогда
				
				ОбластьШапка.Параметры["ВычетМедицина"] = ПризнакСогласия;
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ВознагражденияПоЖилищнымЗаймам Тогда
				
				ОбластьШапка.Параметры["ВычетВознаграждения"] = ПризнакСогласия;
				
			ИначеЕсли ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя
				ИЛИ ВыборкаПоДокументам.ВидВычета = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей Тогда
				
				ОбластьШапка.Параметры["ВычетМногоденые"] = ПризнакСогласия;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьШапка);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ДанныеДляПечатиЗаявленияНаПредоставлениеВычетов(МассивОбъектов)
	
	ДатаКонтроля = '2018-01-01';
	
	// Запрос по шапкам документов до 2018
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("МесяцКонтроль",  ДатаКонтроля);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Сотрудник,
	|	ДанныеДокумента.Сотрудник.ИНН КАК ИИНСотрудника,
	|	ДанныеДокумента.ИзменитьСтандартныйВычет,
	|	ДанныеДокумента.ПредоставлятьСтандартныйВычет,
	|	ДанныеДокумента.ИзменитьЛьготу,
	|	ДанныеДокумента.ПредоставлятьЛьготу,
	|	ДанныеДокумента.ДействуетДо,
	|	ДанныеДокумента.КатегорияЛицаПолучателяЛьготы,
	|	ДанныеДокумента.ДокументПодтверждающийПравоНаЛьготу,
	|	ДанныеДокумента.ИзменитьПрочиеВычеты,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация ЕСТЬ NULL 
	|			ТОГДА """"
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.Организация.НаименованиеСокращенное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.Организация.Наименование
	|		ИНАЧЕ ДанныеДокумента.Организация.НаименованиеСокращенное
	|	КОНЕЦ КАК НазваниеОрганизации
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	И ДанныеДокумента.Месяц < &МесяцКонтроль";
	
	Запрос.Выполнить();
	
	ЗарплатаКадрыРасширенный.СоздатьВТОтветственныеЛица(Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов", "Руководитель");			   
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Номер КАК Номер,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.Сотрудник,
	|	ДанныеДокументов.ИИНСотрудника,
	|	ДанныеДокументов.ИзменитьСтандартныйВычет,
	|	ДанныеДокументов.ПредоставлятьСтандартныйВычет,
	|	ДанныеДокументов.ИзменитьЛьготу,
	|	ДанныеДокументов.ПредоставлятьЛьготу,
	|	ДанныеДокументов.ДействуетДо,
	|	ДанныеДокументов.КатегорияЛицаПолучателяЛьготы,
	|	ДанныеДокументов.ДокументПодтверждающийПравоНаЛьготу,
	|	ДанныеДокументов.ИзменитьПрочиеВычеты,
	|	ДанныеДокументов.Дата КАК Период,
	|	ДанныеДокументов.НазваниеОрганизации КАК НазваниеОрганизации,
	|	ЕСТЬNULL(ОтветственныеЛица.Руководитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФИОДиректораОрганизации
	|ПОМЕСТИТЬ ВТДанныеДокументовОтветственныеЛица
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственныеЛица КАК ОтветственныеЛица
	|		ПО ДанныеДокументов.Организация = ОтветственныеЛица.Организация";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Номер КАК Номер,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Организация,
	|	ДанныеДокументов.Сотрудник,
	|	ДанныеДокументов.ИИНСотрудника,
	|	ДанныеДокументов.ИзменитьСтандартныйВычет,
	|	ДанныеДокументов.ПредоставлятьСтандартныйВычет,
	|	ДанныеДокументов.ИзменитьЛьготу,
	|	ДанныеДокументов.ПредоставлятьЛьготу,
	|	ДанныеДокументов.ДействуетДо,
	|	ДанныеДокументов.КатегорияЛицаПолучателяЛьготы,
	|	ДанныеДокументов.ДокументПодтверждающийПравоНаЛьготу,
	|	ДанныеДокументов.ИзменитьПрочиеВычеты,
	|	ДанныеДокументов.НазваниеОрганизации КАК НазваниеОрганизации,
	|	ДанныеДокументов.ФИОДиректораОрганизации КАК ФИОДиректораОрганизации
	|ИЗ
	|	ВТДанныеДокументовОтветственныеЛица КАК ДанныеДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("РезультатПоШапкеДо2018", РезультатЗапроса);
	
	// Запрос по табличной часте "Прочие вычеты" до 2018
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("МесяцКонтроль",  ДатаКонтроля);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧПрочиеВычеты.Ссылка КАК Ссылка,
	|	ТЧПрочиеВычеты.ВидВычетаИПН,
	|	ТЧПрочиеВычеты.Размер,
	|	ТЧПрочиеВычеты.ДействуетПо,
	|	ТЧПрочиеВычеты.ДокументПодтверждающийПравоНаВычет
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ТЧПрочиеВычеты
	|ГДЕ
	|	ТЧПрочиеВычеты.Ссылка В(&МассивОбъектов)
	|	И ТЧПрочиеВычеты.Ссылка.Месяц < &МесяцКонтроль
	|	И ТЧПрочиеВычеты.Ссылка.ИзменитьПрочиеВычеты = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПечати.Вставить("РезультатПоТабличнойЧастиДо2018", РезультатЗапроса);
	
	// Запрос по шапкам документов после 2018
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("МесяцКонтроль",  ДатаКонтроля);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧПрочиеВычеты.Ссылка,
	|	ТЧПрочиеВычеты.ВидВычетаИПН,
	|	СУММА(ТЧПрочиеВычеты.Размер * ВЫБОР
	|			КОГДА НЕ МЕСЯЦ(ТЧПрочиеВычеты.ДействуетС) = МЕСЯЦ(ТЧПрочиеВычеты.ДействуетПо)
	|				ТОГДА МЕСЯЦ(ТЧПрочиеВычеты.ДействуетПо) - МЕСЯЦ(ТЧПрочиеВычеты.ДействуетС) + 1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК СуммаИтог
	|ПОМЕСТИТЬ ВТ_ИтогиПрочихВычетов
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ПрочиеВычеты КАК ТЧПрочиеВычеты
	|ГДЕ
	|	ТЧПрочиеВычеты.Ссылка В(&МассивОбъектов)
	|	И ТЧПрочиеВычеты.ВидВычетаИПН = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	ВидВычетаИПН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Месяц КАК Месяц,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.Сотрудник.ИНН КАК ИИНСотрудника,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация ЕСТЬ NULL 
	|			ТОГДА """"
	|		КОГДА ПОДСТРОКА(ДанныеДокумента.Организация.НаименованиеСокращенное, 1, 10) = """"
	|			ТОГДА ДанныеДокумента.Организация.Наименование
	|		ИНАЧЕ ДанныеДокумента.Организация.НаименованиеСокращенное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ДанныеДокумента.Организация.ИНН КАК ИИНБИНОрганизации,
	|	ЕСТЬNULL(ИтогиПрочихВычетов.СуммаИтог, 0) КАК СуммаВычета,
	|	ЕСТЬNULL(ЗаявлениеНаПредоставлениеВычетовИПНВычеты.Основание, """") КАК Основание,
	|	ЕСТЬNULL(ЗаявлениеНаПредоставлениеВычетовИПНВычеты.ВидВычетаИПН, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
	|	ЕСТЬNULL(ЗаявлениеНаПредоставлениеВычетовИПНВычеты.ВидВычетаИПН.Приоритет,0) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Вычеты КАК ЗаявлениеНаПредоставлениеВычетовИПНВычеты
	|		ПО ДанныеДокумента.Ссылка = ЗаявлениеНаПредоставлениеВычетовИПНВычеты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПрочихВычетов КАК ИтогиПрочихВычетов
	|		ПО ИтогиПрочихВычетов.ВидВычетаИПН = ЗаявлениеНаПредоставлениеВычетовИПНВычеты.ВидВычетаИПН
	|			И ИтогиПрочихВычетов.Ссылка = ЗаявлениеНаПредоставлениеВычетовИПНВычеты.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	И ДанныеДокумента.Месяц >= &МесяцКонтроль
    // печатаем также пустой бланк заявления
	|	И (ЗаявлениеНаПредоставлениеВычетовИПНВычеты.ПредоставлятьВычет = ИСТИНА
	|		ИЛИ ЗаявлениеНаПредоставлениеВычетовИПНВычеты.Ссылка ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеДокумента.Дата КАК Период,
	|	ВТ_ДанныеДокумента.Сотрудник КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_КадровыеДанные
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.Дата,
	|	Сотрудник";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТ_КадровыеДанные");
	
	КадровыеДанные = "ФИОПолные, ИОФамилия, Пол, ИНН";
	
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.НаименованиеОрганизации,
	|	ДанныеДокумента.ИИНБИНОрганизации,
	|	ДанныеДокумента.Основание,
	|	ДанныеДокумента.ВидВычета,
	|	ДанныеДокумента.Приоритет КАК Приоритет,
	|	ДанныеДокумента.Месяц КАК Месяц,
	|	ДанныеДокумента.СуммаВычета КАК СуммаВычета,
	|	ЕСТЬNULL(ДанныеСотрудников.ФИОПолные, """") КАК ФИОПолные,
	|	ЕСТЬNULL(ДанныеСотрудников.ИОФамилия, """") КАК ИОФамилия,
	|	ЕСТЬNULL(ДанныеСотрудников.Пол, """") КАК Пол,
	|	ЕСТЬNULL(ДанныеСотрудников.ИНН, """") КАК ИНН
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ДанныеСотрудников
	|		ПО ДанныеДокумента.Сотрудник = ДанныеСотрудников.ФизическоеЛицо
	|			И ДанныеДокумента.Дата = ДанныеСотрудников.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеДляПечати.Вставить("РезультатДокументы", РезультатЗапроса);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

Функция ТекстЗапросаКонфликтующиеРегистраторы() Экспорт
	
	Возврат "ВЫБРАТЬ
		|	ПрименениеВычетовИПН.Регистратор,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПрименениеВычетовИПН.Регистратор) КАК ПредставлениеРегистратора
		|ИЗ
		|	РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|ГДЕ
		|	ПрименениеВычетовИПН.Период = &Период
		|	И ПрименениеВычетовИПН.ФизическоеЛицо = &ФизическоеЛицо
		|	И ПрименениеВычетовИПН.Регистратор <> &Регистратор";
	
КонецФункции

#КонецОбласти

#КонецЕсли
